src/app/controllers/dashboards_controller.rb

  def show
    base_games = current_user.games
                             .includes(:opponent_team, :stadium)

    # --- フィルタ適用 ---
    @filter_year     = params[:year].presence
    @filter_opponent = params[:opponent].presence
    @filter_stadium  = params[:stadium].presence

    base_games = base_games.where("EXTRACT(YEAR FROM date) = ?", @filter_year.to_i) if @filter_year
    base_games = base_games.where(opponent_team_id: @filter_opponent)                if @filter_opponent
    base_games = base_games.where(stadium_id: @filter_stadium)                       if @filter_stadium

    # フィルタ後の全件（サマリ計算用）
    @games = base_games.order(date: :desc, id: :desc)

    # --- フィルタ選択肢 ---
    user_games = current_user.games.includes(:opponent_team, :stadium)
---
SELECT "stadiums".* FROM "stadiums" WHERE "stadiums"."id" IN (1, 3)
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1, 2)
SELECT "games".* FROM "games" WHERE "games"."user_id" = 1 ORDER BY "games"."date" DESC, "games"."id" DESC
SELECT "games".* FROM "games" WHERE "games"."id" = 9
SELECT "stadiums".* FROM "stadiums" WHERE "stadiums"."id" = 3
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 6 LIMIT 1