src/app/controllers/games_controller.rb

INSERT INTO "games" ("user_id", "opponent_team_id", "stadium_id", "date", "home_away", "starting_pitcher", "favorite_team_score", "opponent_score", "custom_stadium_name", "result", "video_url", "created_at", "updated_at") VALUES (1, 2, 4, '2026-02-16', 0, '', 2, 0, NULL, 0, '', '2026-02-16 12:31:58.603737', '2026-02-16 12:31:58.603737') RETURNING "id"
---
  def create
    # ① 写真を params から先に取り出す（game_params に含めない）
    new_photos = extract_photos_from_params
    cached_signed_ids = extract_cached_signed_ids

    @game = current_user.games.build(game_params)

    if @game.save

DELETE FROM "games" WHERE "games"."id" = 14
UPDATE "games" SET "stadium_id" = 4, "updated_at" = '2026-02-16 12:33:22.821074' WHERE "games"."id" = 16
---
  def update
    # 1. 削除チェックされた写真を処理
    remove_ids = params.dig(:game, :remove_photo_ids)
    params[:game]&.delete(:remove_photo_ids)

    if remove_ids.present?
      ActiveStorage::Attachment.where(
        id: remove_ids,
        record_type: "Game",
        record_id: @game.id,
        name: "photos"
      ).each(&:purge)
      @game.reload  # キャッシュをクリア
    end

    # 2. 新規写真を取り出す
    new_photos = extract_photos_from_params

    # 3. 写真以外のフィールドを更新
    if @game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = 17
---
  def destroy
    if @game.destroy

SELECT "games".* FROM "games" WHERE "games"."user_id" = 1 AND "games"."id" = 16 LIMIT 1
---
  def set_game
    @game = current_user.games.find(params[:id])

SELECT "teams".* FROM "teams" ORDER BY "teams"."league" ASC, "teams"."last_year_rank" ASC, "teams"."id" ASC
SELECT "stadiums".* FROM "stadiums" ORDER BY "stadiums"."id" ASC
---
  def load_masters
    @teams = Team.order(:league, :last_year_rank, :id)
    @stadiums = Stadium.order(:id)

INSERT INTO "active_storage_blobs" ("key", "filename", "content_type", "metadata", "service_name", "byte_size", "checksum", "created_at") VALUES ('cu14aj688e0gi3s7ogf730b599q5', '☆75eee165-5c24-48fd-9e94-ce71cae8b0a3_wm.jpg', 'image/jpeg', '{"identified":true}', 'local', 668275, 'A8VhubtjDMISKbKKy33SzQ==', '2026-02-16 12:31:58.646215') RETURNING "id"
---
  def cache_photos_as_blobs(photos)
    return [] unless photos.present?

    photos.filter_map do |photo|
      photo.rewind if photo.respond_to?(:rewind)
      blob = ActiveStorage::Blob.create_and_upload!(
        io: photo,
        filename: photo.original_filename,
        content_type: photo.content_type
      )