src/app/controllers/games_controller.rb

UPDATE "games" SET "updated_at" = '2026-02-16 10:40:59.554869' WHERE "games"."id" = 13
---
  def update
    if @game.update(game_params)

SELECT "games".* FROM "games" WHERE "games"."id" = 16 LIMIT 1
---
  def set_game
    @game = current_user.games.find(params[:id])

SELECT "teams".* FROM "teams" ORDER BY "teams"."id" ASC
---
  def load_masters
    @teams = Team.order(:id)