src/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at", "name", "favorite_team_id") VALUES ('bbb@bbb', '$2a$10$ej3IKc4aMfpn5vc0xjs5muMtku4yYsmlKgSn6O4BwgcTf8je1kJs.', 'xBygxxLsGXkP3mM8Zpx5', '2026-02-02 14:27:03.317979', '2026-02-02 14:27:03.317979', 'bbb', 2) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    set_teams

    if @user.save

SELECT "teams".* FROM "teams" WHERE "teams"."name" IN ('阪神タイガース', '横浜DeNAベイスターズ', '読売ジャイアンツ', '中日ドラゴンズ', '広島東洋カープ', '東京ヤクルトスワローズ', '福岡ソフトバンクホークス', '北海道日本ハムファイターズ', 'オリックス・バファローズ', '東北楽天ゴールデンイーグルス', '埼玉西武ライオンズ', '千葉ロッテマリーンズ')
---
  def set_teams
    order = Team::ORDER_BY_LAST_SEASON
    @teams = Team.where(name: order).to_a.sort_by { |t| order.index(t.name) }